posts/being-a-full-stack-dev.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 02:40 PM on  2 Jan, 2023 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Being a full-stack developer</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Michael Wang" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
                     <link rel="stylesheet" href="/css/style.css" />
</head>
<body>
<div id="preamble" class="status">
<nav>
    <ul class="navbar">
        <li><a href="/">Home</a></li>
        <li><a href="/posts">Blog</a></li>
        <li><a href="https://github.com/mwonng">Github</a></li>
    </ul>
</nav>
</div>
<div id="content">
<h1 class="title">Being a full-stack developer</h1>
<div class="PREVIEW">
<p>
To be a full-stack developer is really a little hard for anyone including myself.
</p>

<p>
Within coding and design, even documentation are my main job everyday. Compare to coding, design and documentation use more time. Customers care more about these two part even more than user experience which is combined by those three(the one i thought was most important in any software/system) was dismissed most of time.
</p>

<p>
After my Objective-C, Php, Ruby on Rails, Html5, css, Javescript and etc, I was focus on <a href="http://www.filemaker.com">FileMaker</a> in past two years as a small business.
</p>

</div>

<p>
To be a full-stack developer is really a little hard for anyone including myself.
</p>

<p>
Within coding and design, even documentation are my main job everyday. Compare to coding, design and documentation use more time. Customers care more about these two part even more than user experience which is combined by those three(the one i thought was most important in any software/system) was dismissed most of time.
</p>

<p>
After my Objective-C, Php, Ruby on Rails, Html5, css, Javescript and etc, I was focus on <a href="http://www.filemaker.com">FileMaker</a> in past two years as a small business.
</p>

<p>
<b>Let's talk about it,</b>
</p>

<p>
I have to say it is a wired way to do a solution although it sometimes fast than traditional development.
</p>

<p>
During using <i><a href="http://www.filemaker.com/">FileMaker</a></i> these years, it really important to find out it's global storage type. Generally, it's used as session most time by me. It's like a session and cookies in B/S structure. I use that for remember user's temp variables.
</p>

<p>
In multi-user environment, it will not saved on server side. Only user can see or change themselves.
</p>

<p>
Being develop a <i>[[<a href="http://www.filemaker.com">http://www.filemaker.com</a>][FileMaker]</i> solution provider, you have to be a real full-stack developer because it's a little hard to separate design work. In one word, I don't think FileMaker is a good platform for collaboration with mates especially for work remotely.
</p>

<p>
<a href="http://www.filemaker.com">FileMaker</a> is popular in US, Japan and Australia. United States has biggest market and the 2nd is Japan. I saw a lot of developer from Australia. But since now, FileMaker conference has not held in Australia before.
</p>

<p>
Fortunately, my company was invited by FileMaker Conference in Japan and US. So let take look at the end of this month of FileMaker Conference on Tokyo.
</p>

<hr />
<p>
<b>Reference:</b>
</p>
<ul class="org-ul">
<li><a href="http://en.wikipedia.org/wiki/FileMaker">FileMaker on Wikipedia</a></li>
<li><a href="http://en.wikipedia.org/wiki/User_experience">User experience (UX) on Wikipedia</a></li>
<li><a href="http://37signals.com/remote/">Book: Remote: Office Not Required</a></li>
</ul>
</div>
<div id="postamble" class="status">
<p class="date">Posted at 12:00 AM on 12 Jul, 2016 </p>
<p class="author">By Michael Wang</p>
<script src="https://utteranc.es/client.js"
    repo="mwonng/mwonng.github.io"
    issue-term="pathname"
    theme="github-light"
    crossorigin="anonymous"
    async>
</script>
</div>
</body>
</html>
